import { FeatureTab } from "@/types/featureTab";

const featuresTabData: FeatureTab[] = [
  {
    id: "tabOne",
    title: "감정에 언어를 부여하다",
    desc1: `🧩 "감정에 언어를 부여하다"
📘 “이건 그냥 기분 탓이 아니었구나.”
혼란스럽고 애매했던 감정,
멜팅팩토리는 그 감정에 이름을 붙이게 해줘요.
슬픔, 당황, 외로움, 회피…
이해하는 순간, 마음의 실루엣이 또렷해져요.`,
    desc2: `감정을 ‘느끼는 것’에서
‘읽는 것’으로 바꾸는 첫 걸음.`,
    image: "/images/features/features-light-01.png",
    imageDark: "/images/features/features-dark-01.svg",
  },
  {
    id: "tabTwo",
    title: "반응 대신 감정을 선택하다",
    desc1: `🧠 "반응 대신 선택하다"
🔄 “또 그랬네… 근데 이번엔 알겠다.”
늘 비슷한 상황, 똑같은 반응.
그게 습관이자 패턴이라는 걸
워크북을 통해 처음 알게 됐어요.
⠀
감정은 더 이상 나를 끌고 가지 않고,
이제는 내가 반응을 선택할 수 있어요.`,
    desc2: `감정의 자동반사를 멈추고,
나답게 반응하는 연습.`,
    image: "/images/features/features-light-01.png",
    imageDark: "/images/features/features-dark-01.svg",
  },
  {
    id: "tabThree",
    title: "감정 속 숨겨진 힘을 회복하다",
    desc1: `💡"감정 속 숨겨진 힘을 회복하다"
🌼 “이 성격, 나쁜 것만은 아니었구나.”
회피, 예민함, 차가움…
문제처럼 느껴졌던 감정 뒤에는
내가 버티고 살아온 방식, 나만의 숨겨진 힘이 있었어요.
⠀
멜팅팩토리는 그 감정 속에 숨어 있던
나를 지켜온 에너지를 꺼내주고,
스스로를 다시 이해하고 받아들이게 해줘요.`,
    desc2: `감정은 약점이 아니라,
내가 살아온 증거이자 힘이었어요.`,
    image: "/images/features/features-light-01.png",
    imageDark: "/images/features/features-dark-01.svg",
  },
];

export default featuresTabData;
